package com.ccl.oop;

/*
	笔记
	1.面向对象编程的内容
	 
	2.面向过程与面向对象
	 面向过程：强调的功能行为，以函数为最小单位，考虑怎么做；
	 面向对象：强调了具备了功能的对象，以类/对象为最小单位，考虑谁来做。
	
	3.面向对象中两个重要的概念
	  类： 对一类事物的描述，是抽线上、概念上的定义；	  
	  对象：是实际存在的该类事物的每个个体，也叫做实例；
	  	面向对象程序设计的重点就是类的设计；
	  	设计类就是设计类的成员。
	  二者的关系： 对象是由类实例出来的。
	  	
	4.面向对象思想的体现一：类和对象的创建 和执行操作有哪三步？
 	①创建类；②创建类的实例化；③通过对象结构调用属性和方法执行。
	
	5.对象的创建与对象的内存的解析
	
	
	6.JVM内存结构
	  编译完成后，生成一个或多个字节码文件。
	  
	 将局部变量存放在栈（stack）中。将new的结构（数组、对象等）存放在堆（）空间中。（对象的非static属性是放在堆空间中的）
	 
	7.
	
 */
/*
 * Project
 * 1.面向对象编程的内容
 * 	①类及类的成员：成员属性、成员方法、构造器；代码块，内部类
 * 	②三大特征：
 * 		封装：使用权限修饰符的属性、方法、类等都是封装的体现
 * 		继承：
 * 		多态：
 * 	③其他关键字：this、supper、static、final、abstract、interface、package、import……
 * 
 * 2.面向对象中类和对象的理解 并指出二者的关系
 * 	类：对事物的描述，是抽象的内容。
 *	对象：现实中的一个个体。
 * 	举具体的使用的类。对象是由类派生出来的。
 * 
 * 
 * 3.面向对象思想的体现一：类和对象的创建 和执行操作有哪三步？
 * 	①创建类；②创建类的实例化；③通过对象结构调用属性和方法执行。
 * 
 * 4.画出如下代码在执行时的内存分配情况
class Car{
	String color = "red";
	int num = 4;
	void show() {
		int a = 10;
		System.out.println("color="+color+",num="+num);
	}
}

class CarTest{
	public static void main(String[] args) {
		Car c1 = new Car();
		Car c2 = new Car();
		c1.color = "blue";
		c1.show();
		c2.show();
	}
}

 *	
 * 5.类的方法内是否可以定义变量? 是否可以调用属性? 是否可以定义方法? 是否可以调用方法?
 * 	是 是 否 是
 * 
 * 
 * 
 * 
 */
public class OOPNote {

}


